Repository: steinm/pxcrypt
Catalog: po/*.po
Languages: de

source: %s encrypts a paradox file.
de: %s verschlüsselt eine Paradox-Datei.

source: %s decrypts a paradox file.
de: %s entschlüsselt eine Paradox-Datei.

source: %s decrypts or encrypts a paradox file.
de: %s entschlüsselt oder verschlüsselt eine Paradox-Datei.

source: Usage: %s [OPTIONS] FILE
de: Aufruf: %s [OPTION] DATEI

source: General options:
de: Allgemeine Optionen:

source: -h, --help this usage information.
de: -h, --help diese Hilfe.

source: --version show version information.
de: --version zeige Programmversion.

source: -v, --verbose be more verbose.
de: -v, --verbose mehr Informationen anzeigen.

source: --database-file=FILE .db file if en/decrypting .mb files.
de: --database-file=DATEI .db-Datei, wenn .mb-Datei ver/entschlüsselt werden.

source: --use-gsf use gsf library to read input file.
de: --use-gsf benutze gsf-Bibliothek zum Lesen der Eingabedatei.

source: -o, --output-file=FILE output data into file instead of stdout.
de: -o, --output-file=DATEI schreibe Ausgabe in Datei statt nach stdout.

source: Options to select mode:
de: Optionen, die den Modus betreffen:

source: --mode=MODE set operation mode (encrypt, decrypt).
de: --mode=MODE setze Modus (encrypt, decrypt).

source: -e, --encrypt encrypt file.
de: -e, --encrypt verschlüssel Datei.

source: -d, --decrypt decrypt file.
de: -d, --decrypt entschlüssel Datei.

source: Encryption options:
de: Optionen für die Verschlüsselung

source: --password=WORD set password for encryption.
de: --password=WORD setze Passwort für Verschlüsselung.

source: libpx has been compiled for big endian architecture.
de: libpx wurde für Architekturen mit big endian übersetzt.

source: libpx has been compiled for little endian architecture.
de: libpx wurde für Architekturen mit little endian übersetzt.

source: libpx has gsf support: %s
de: libpx hat Unterstützung für die gsf-Bibliothek: %s

source: Yes
de: Ja

source: No
de: Nein

source: libpx has version: %d.%d.%d
de: libpx ist Version: %d.%d.%d

source: You must at least specify an input file.
de: Sie müssen mindestes eine Eingabedatei angegeben.

source: Encryption mode requires a password.
de: Verschlüsselungsmodus erfordert Angabe eines Passworts.

source: Could not open output file.
de: Konnte Ausgabedatei nicht öffnen.

source: Could not create new paradox instance.
de: Konnte eine neue Paradox-Instanz nicht anlegen.

source: Could not open gsf input file.
de: Konnte Eingabedatei mit gsf-Bibliothek nicht öffnen.

source: Could not open input file.
de: Sie müssen mindestes eine Eingabedatei angegeben.

source: Input file is already encrypted.
de: Eingabedatei ist bereits verschlüsselt.

source: Could not allocate memory for header of input file.
de: Konnte Speicher für Kopf der Eingabedatei nicht allozieren.

source: Could not seek start of input file.
de: Konnte nicht an den Anfang der Eingabedatei springen.

source: Could not read header of input file.
de: Konnte Kopf der Eingabedatei nicht lesen.

source: Could not write header to output file.
de: Konnte Kopf nicht in Ausgabedatei schreiben.

source: Could not allocate memory for block of input file.
de: Konnte Speicher für Datenblock der Eingabedatei nicht allozieren.

source: File has %d data blocks.
de: Datei hat %d Daten-blöcke.

source: Could not read block from input file.
de: Konnte Datenblock aus Eingabedatei nicht lesen.

source: Writing block %d.
de: Schreibe Datenblock %d.

source: Could not write block to output file.
de: Konnte Datenblock nicht in Ausgabedatei schreiben.

source: Database file is not encrypted.
de: Datenbankdatei ist nicht verschlüsselt.

source: Could not create new blob file object.
de: Konnte eine neue Blob-Datei nicht anlegen.

source: Could not open blob file.
de: Konnte Blob-Datei nicht öffnen.

source: Could not fseek start of blob file.
de: Konnte nicht an den Anfang der Blob-Datei springen.

source: Input file is not encrypted.
de: Eingabedatei ist nicht verschlüsselt.
